{
    "G": {
        "1": {
            "1": "Drivers should not intentionally affect another driver's race as to intentionally remove them from the track or racing line in a way that destroys their ability to continue racing.",
            "2": "Everyone has the responsibility to race as fairly and as sportsmanlike as possible, with respect for the other drivers, in order to ensure the most enjoyable racing experience and the competitive integrity of the leagues.",
            "3": "Violations of the code will be considered the driver's responsibility depending on the conditions surrounding the incident, such as lag or crowded sections.",
            "4": "If a car is not directly beside a driver but within 2 car lengths of the rear wing it may be assumed to be on the racing line beside them. The driver should minimise risk at all costs but may use a smooth movement that would indicate to the driver behind that they are closing off that lane.",
            "5": {
                "1": [
                    "Divebomb",
                    "Cutting-off or re-entering track into a vehicle to draw a penalty, including dive bombing a corner irresponsibly causing an accident or lag rocket."
                ],
                "2": "Tackling or positioning the car to be tackled to draw a penalty or cause a lag rocket from behind.",
                "3": "Brake-checking to stop other vehicles' forward progress or to draw a penalty.",
                "4": [
                    "Edging on Corner / Leaving space",
                    "Failing to leave room on a turning lane, including vehicles who are not side by side on the driver's screen but could be due to lag/ping."
                ],
                "5": [
                    "Edging/Weaving on Straight",
                    "Swerving or weaving in front of a car."
                ],
                "6": [
                    "Unsafe Track Exit / Re-Entry",
                    "Returning to the track to cause a collision from the grass or the pitlane, instead of taking the time to enter when there are no cars beside the driver or approaching their path."
                ],
                "7": "Retiring the car in a spot where it may be hit or will be a visual distraction to other drivers."
            },
            "6": {
                "1": "Deliberately leaving the track boundaries, like the outfield or grass sections, therefore taking the car out of the competition.",
                "2": "Driving backwards for any reason other than to right your own vehicle to the racing line.",
                "3": "Becoming repeat-offender to the point of disrespecting the spirit or integrity of the game so much that there is an evident blatant disregard for the rules or their enforcement."
            },
            "7": {
                "1": "Any violation outlined in §G.1.5 may be punished as a minor violation.",
                "2": "Any violation outlined in §G.1.6 may be punished as a major violation."
            }
        },
        "2": {
            "1": "The rules in §G.1 apply when it comes to pitting procedures.",
            "2": {
                "1": "Entering the pit road safely is each driver's responsibility.",
                "2": "Drivers should be wary of their and other drivers' pit boxes in custom tracks such that they do not impede or block someone trying to enter or exit the pitlane or pit box.",
                "3": "Drivers should use the pitlane until they get to their pit box. If they cannot safely rejoin the pitlane they should drive close to the wall on the side of the pit boxes in order to avoid any accidental blocking of people attempting to pit.",
                "4": "Drivers should refrain from driving directly through the middle of other teams' pit boxes.",
                "5": "Drivers should apply common sense in default tracks where the pit box is shared and should not deliberately block another driver from pitting."
            },
            "3": "Violations described in §G.2.2 may be punished as a minor violation."
        },
        "3": {
            "1": "Drivers should avoid continued chatting as it can be distracting for other drivers and should keep it to an absolute minimum.",
            "2": "Approved short messages\n\t\"S\" Indicate to a driver you just want to slipstream\n\t\"B\" Blue flag warning, if applicable\n\t\"L\" or \"LL\" Lag or lots of lag, to let SLOs know of issues\n\t\"DNF\" Followed by the reason for retirement",
            "3": [
                "Chatting in Race",
                "Excessive chatting which is considered a violation may be warned and punished as a minor violation. If it is considered a particularly bad violation it will be punished as a major violation."
            ]
        },
        "4": {
            "1": "Drivers may retire themselves from the race at any time if they can't continue the race, but should do so in a safe way.",
            "2": "Drivers should not leave the lobby if possible, as it may cause lag issues and in the worst case a crash. Tabbing out of the game is not advised either.",
            "3": "Drivers should announce their DNF and a short reason why, as well as place their car in a safe place which does not affect the remaining racers.",
            "4": "Drivers should not return to the lobby if they were disconnected unless it is clear that the race is no longer underway. If a new lobby is created it will be properly announced in the appropriate channel.",
            "5": {
                "1": "The driver's lag is that of an individual nature that no other racers are reporting in chat and they are freezing/teleporting/lagging repeatedly in a way that is causing them to unexpectedly and inconsistently collide with other cars.",
                "2": "A real life event will cause the driver to have to quit the race and not be able to return for the remainder of the race.",
                "3": "The driver has a controller or mechanical issue that still allows them to steer the car to safety."
            },
            "6": "Drivers should never leave the car in the middle of the road if they can avoid it nor return to normal racing after announcing their DNF. If they do so they may be punished as a major violation and will be disqualified from that event."
        },
        "5": {
            "1": "A driver who is DQ'd for a manoeuvre at a point during the race may have additional penalisations if deemed appropriate.",
            "2": "The SLOs will be in charge of deciding on additional penalties beyond the DQ itself"
        }
    },
    "H": {
        "1": {
            "1": "If another driver asks you to stop discussing a topic with them after the race and you continue to do so you will be subject to disciplinary action by the FIA.",
            "2": "Continued harassment of a driver in regards to an event may escalate the severity of the sanctions even for a first time offender. This includes, but is not limited to, dragging the argument to other channels, defaming their character or name calling in public channels other than the race channel."
        }
    },
    "S": {
        "0": "Applimazing is the owner of this server.",
        "1": "No hateful speech.  This includes insulting, flaming, and personal attacks. Toxic speech or behavior will get you permanently banned. This includes racism of any kind.",
        "2": "Be respectful.  Treat others the way you want to be treated and avoid religion, politics or other controversial topics. That's not what this Discord is for.",
        "3": "No NSFW (Not safe/suitable for work) allowed, like gore, gambling, sexual, explicit, or disturbing content.",
        "4": "Keep it clean. No excessive swearing- We would like this chat to be positive and fairly family friendly.",
        "5": "No spamming, begging, advertising, selling or promotion.  This includes private messages to our members.",
        "6": "No spoilers.",
        "7": "No Recruiting for other Discord servers, forums or clans."
    }
}